**This script contains the following points:**

    1. Importing libraries
    2. Importing data
    3. Consistency checks
        3.1 products dataframe
            3.1.1 Missing values
            3.1.2 Mixed-type data
            3.1.3 Duplicates
        3.2 orders_wrangled dataframe
            3.2.1 Missing values
            3.2.2 Mixed-type data
            3.2.3 Duplicates   
    4. Exporting data

# 1. Importing libraries

In [48]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 2. Importing data

In [49]:
# Turn project folder path into a string
path = r'/Users/sarahtischer/Desktop/CareerFoundry/Data Immersion/Achievement 4/01-2024_Instacart_Basket_Analysis'

In [50]:
# Import "products.csv"
df_prods = pd.read_csv(os.path.join(path, '02_Data', 'Original_data', 'products.csv'), index_col = False)

In [51]:
df_prods.shape

(49693, 5)

In [52]:
# Import "orders_wrangled.csv"
df_ords = pd.read_csv(os.path.join(path, '02_Data', 'Prepared_data', 'orders_wrangled.csv'), index_col = False)

In [53]:
df_ords.shape

(3421083, 6)

# 3. Consistency checks

## 3.1 products dataframe

In [54]:
# Suppress scientific notation by specifying the display format for floating-point numbers
pd.options.display.float_format = '{:,.2f}'.format

# Print descriptive statistics (Question 2)
df_prods.describe()

       product_id  aisle_id  department_id    prices
count   49,693.00 49,693.00      49,693.00 49,693.00
mean    24,844.35     67.77          11.73      9.99
std     14,343.72     38.32           5.85    453.52
min          1.00      1.00           1.00      1.00
25%     12,423.00     35.00           7.00      4.10
50%     24,845.00     69.00          13.00      7.10
75%     37,265.00    100.00          17.00     11.20
max     49,688.00    134.00          21.00 99,999.00

#### *<mark>Answer:</mark> The descriptive statistics for the products dataframe show a maximum value for the 'prices' column of 99,999.00, which seems unusually high for grocery prices. It is possible that there is an outlier or an error in the data. Realistic prices are typically not that high.*

### 3.1.1 Missing values

In [55]:
# Find missing values
df_prods.isnull().sum() # Find missing observations and sum results by column

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [56]:
# Create subset of missing observations
df_nan = df_prods[df_prods['product_name'].isnull() == True]

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14   12.20
68             69          NaN        26              7   11.80
115           116          NaN        93              3   10.80
261           262          NaN       110             13   12.10
525           525          NaN       109             11    1.20
1511         1511          NaN        84             16   14.30
1780         1780          NaN       126             11   12.30
2240         2240          NaN        52              1   14.20
2586         2586          NaN       104             13   12.40
3159         3159          NaN       126             11   13.10
3230         3230          NaN       120             16   14.40
3736         3736          NaN        41              8   14.80
4283         4283          NaN        77              7   14.40
4790         4790          NaN        91             16   14.50
38187       38183          NaN        39             12   20.90
40444       40440          NaN       120             16   14.80

In [57]:
# Print dimensions of df_prods
df_prods.shape

(49693, 5)

In [58]:
# Create subset without missing observations
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

# Print dimensions of df_prods_clean
df_prods_clean.shape

(49677, 5)

### 3.1.2 Mixed-type data

In [59]:
# Check for mixed types (Question 3)
for col in df_prods_clean.columns.tolist():
  mixed = (df_prods_clean[[col]].map(type) != df_prods_clean[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods_clean[mixed]) > 0:
    print (col)

### 3.1.3 Duplicates

In [60]:
# Find full duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.80
18459,18458,Ranger IPA,27,5,9.20
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.40
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.80
35495,35491,Adore Forever Body Wash,127,11,9.90

In [61]:
# Print dimensions of df_prods_clean
df_prods_clean.shape

(49677, 5)

In [62]:
# Create subset without duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

# Print dimensions of df_prods_clean_no_dups
df_prods_clean_no_dups.shape

(49672, 5)

## 3.2 orders_wrangled dataframe

In [63]:
# Suppress scientific notation by specifying the display format for floating-point numbers
pd.options.display.float_format = '{:,.2f}'.format

# Print descriptive statistics (Question 2)
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,"3,421,083.00","3,421,083.00","3,421,083.00","3,421,083.00","3,421,083.00","3,214,874.00"
mean,"1,710,542.00","102,978.21",17.15,2.78,13.45,11.11
std,"987,581.74","59,533.72",17.73,2.05,4.23,9.21
min,1.00,1.00,1.00,0.00,0.00,0.00
25%,"855,271.50","51,394.00",5.00,1.00,10.00,4.00
50%,"1,710,542.00","102,689.00",11.00,3.00,13.00,7.00
75%,"2,565,812.50","154,385.00",23.00,5.00,16.00,15.00
max,"3,421,083.00","206,209.00",100.00,6.00,23.00,30.00

#### *<mark>Answer:</mark> The descriptive statistics for the orders dataframe don't show any unreasonable values.*

### 3.2.1 Missing values

In [64]:
# Find missing values (Question 5)
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [65]:
# Create subset of missing observations
df_empty = df_ords[df_ords['days_since_prior_order'].isnull() == True]

df_empty

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

#### *<mark>Answer:</mark> The instances of NaN values in the days_since_prior_order column are not really missing values. In fact, they correlate with order_number = 1, which means that this is the user's first order, and therefore there has been no prior order and no time since. Hence, these NaN values should be kept.*

#### *<mark>Note:</mark> No action required for Question 6.*

### 3.2.2 Mixed-type data

In [66]:
# Check for mixed types (Question 3)
for col in df_ords.columns.tolist():
  nonconforming = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[nonconforming]) > 0:
    print (col)

#### *<mark>Answer:</mark> The orders dataframe doesn't contain any mixed-type columns.*

#### *<mark>Note:</mark> No action required for Question 4.*

### 3.2.3 Duplicates

In [67]:
# Find full duplicates (Question 7)
df_dups_ords = df_ords[df_ords.duplicated()]

df_dups_ords

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

#### *<mark>Answer:</mark> There are no duplicates in the orders dataframe.*

#### *<mark>Note:</mark>No action required for Question 8.*

# 04. Exporting data

In [68]:
df_prods_clean_no_dups.shape

(49672, 5)

In [69]:
# Export df_prods_clean_no_dups as "products_checked.csv"
df_prods_clean_no_dups.to_csv(os.path.join(path, '02_Data','Prepared_data', 'products_clean.csv'), index = False)

In [70]:
df_ords.shape

(3421083, 6)

In [71]:
# Export df_ords as "orders_checked.csv"
df_ords.to_csv(os.path.join(path, '02_Data','Prepared_data', 'orders_clean.csv'), index = False)